<a href="https://colab.research.google.com/github/W-Srikongpan/Multivariate_Analysis/blob/main/chapter1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#install packages

In [38]:
install.packages("dplyr")
install.packages("tidyvers")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Warning message:
“package ‘tidyvers’ is not available for this version of R

A version of this package for your version of R might be available elsewhere,
see the ideas at
https://cran.r-project.org/doc/manuals/r-patched/R-admin.html#Installing-packages”

#Import libary

In [39]:
library(dplyr)
library(tidyr)

#Create Data

In [40]:
df1 = data.frame(CustomerId = c(1:6),
                 Product = c("Oven", "Television","Mobile","WashingMachine","Lightings","Ipad"))
df1

  CustomerId Product
1 1          Oven
2 2          Television
3 3          Mobile
4 4          WashingMachine
5 5          Lightings
6 6          Ipad

In [41]:
df2 = data.frame(CustomerId = c(2, 4, 6, 7, 8),
                 State = c("California","Newyork","Santiago","Texas","Indiana"))
df2

  CustomerId State
1 2          California
2 4          Newyork
3 6          Santiago
4 7          Texas
5 8          Indiana

In [42]:
df3 = data.frame(CustomerId = c(10,30,100,50,60,70),
                 Product = c("Oven", "Television","Mobile","WashingMachine","Lightings","Ipad"))
df3

  CustomerId Product
1  10        Oven
2  30        Television
3 100        Mobile
4  50        WashingMachine
5  60        Lightings
6  70        Ipad

# Inner join  

This function allows you to combine data from two sources based on a common key or keys.

In [43]:
df_ij1 = inner_join(df1,df2, by ='CustomerId')
df_ij1

  CustomerId Product        State
1 2          Television     California
2 4          WashingMachine Newyork
3 6          Ipad           Santiago

In [44]:
df_ij2 = df1 %>% inner_join(df2,by="CustomerId")
df_ij2

  CustomerId Product        State
1 2          Television     California
2 4          WashingMachine Newyork
3 6          Ipad           Santiago

# Outer join

A full outer join includes all the rows from both data frames and fills in missing values with NA where there are no matches.

In [45]:
df_U = full_join(x=df1,y=df2,by="CustomerId") # full_join() keeps all observations in x and y.
df_U

  CustomerId Product        State
1 1          Oven           NA
2 2          Television     California
3 3          Mobile         NA
4 4          WashingMachine Newyork
5 5          Lightings      NA
6 6          Ipad           Santiago
7 7          NA             Texas
8 8          NA             Indiana

#Left join

A left join returns all the rows from the left data frame and the matched rows from the right data frame. Rows from the left data frame that do not have corresponding matches in the right data frame will have missing values for the right data frame's columns.

In [46]:
df_left = left_join(x=df1,y=df2,by="CustomerId") # left_join() keeps all observations in x.
df_left

  CustomerId Product        State
1 1          Oven           NA
2 2          Television     California
3 3          Mobile         NA
4 4          WashingMachine Newyork
5 5          Lightings      NA
6 6          Ipad           Santiago

#Right join

A right join returns all the rows from the right data frame and the matched rows from the left data frame. Rows from the right data frame that do not have corresponding matches in the left data frame will have missing values for the left data frame's columns.

In [47]:
df_right = right_join(x=df1,y=df2,by="CustomerId") # right_join() keeps all observations in y.
df_right

  CustomerId Product        State
1 2          Television     California
2 4          WashingMachine Newyork
3 6          Ipad           Santiago
4 7          NA             Texas
5 8          NA             Indiana

#Show result

In [48]:
df_U %>% glimpse()

Rows: 8
Columns: 3
$ CustomerId <dbl> 1, 2, 3, 4, 5, 6, 7, 8
$ Product    <chr> "Oven", "Television", "Mobile", "WashingMachine", "Lighting…
$ State      <chr> NA, "California", NA, "Newyork", NA, "Santiago", "Texas", "…

In [49]:
glimpse(df_U)

Rows: 8
Columns: 3
$ CustomerId <dbl> 1, 2, 3, 4, 5, 6, 7, 8
$ Product    <chr> "Oven", "Television", "Mobile", "WashingMachine", "Lighting…
$ State      <chr> NA, "California", NA, "Newyork", NA, "Santiago", "Texas", "…

#Missing data

In [50]:
results = apply(is.na(df_left),2,which) # check missing data in each column
results

$CustomerId
integer(0)

$Product
integer(0)

$State
[1] 1 3 5

In [51]:
df_UC = drop_na(df_U) # Fillter out the missing values by drop_na
df_UC

  CustomerId Product        State
1 2          Television     California
2 4          WashingMachine Newyork
3 6          Ipad           Santiago